english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* check
:PROPERTIES:
:EXPORT_FILE_NAME: check.md
:END:
询问后又检查重量，还要托运
** 语义
*** 检查
A first rule in solving any mystery is to check the facts.
*** 询问
I'm not authorized to give you a refund - I'll have to check first.
*** 克制
I had to check the urge to laugh out loud.
*** 制止
The police are failing to take adequate measures to check the growth in crime.
*** 托运
Any luggage over five kilos must be checked.
*** 审查
Conduct regular checks on your water quality.
*** 控制
You must learn to keep your emotions in check.
*** 支票
Can I pay by check?
*** 方格图案
Styles include stripes and checks.
** 短语
*** check in
Check in two hours before the flight.

https://youglish.com/getbyid/114943010/check%20in/english
*** check off
One by one he checked them off on his register.

https://youglish.com/getbyid/130209271/check%20off/english
*** check on
Honey, can you go upstairs and check on the kids?

https://youglish.com/getbyid/105535388/check%20on/english
*** check out
https://youglish.com/getbyid/124780851/check%20out/english
**** 核实
I made a phone call to check out his address.
**** 查看
If I hear about a website that sounds interesting, I check it out.
**** 退房
We checked out at noon.
**** 借出
The library allows you to check out six books at a time.
*** check over
They spent the rest of the morning checking over their equipment.

https://youglish.com/getbyid/87043172/check%20over/english
*** check up on
Don't worry; no one is going to check up on you.

https://youglish.com/getbyid/25877160/check%20up%20on/english
